hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_pwmv2_regs.h
/*
 * FAULT_REC_SEL (RW)
 *
 * select one trigger from 8, should set to pulse in trig_mux, used for fault recovery if fault_rec_time is set to 2'b10
 */
#define PWMV2_PWM_CFG1_FAULT_REC_SEL_MASK (0x7U)
#define PWMV2_PWM_CFG1_FAULT_REC_SEL_SHIFT (0U)
#define PWMV2_PWM_CFG1_FAULT_REC_SEL_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG1_FAULT_REC_SEL_SHIFT) & PWMV2_PWM_CFG1_FAULT_REC_SEL_MASK)
#define PWMV2_PWM_CFG1_FAULT_REC_SEL_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG1_FAULT_REC_SEL_MASK) >> PWMV2_PWM_CFG1_FAULT_REC_SEL_SHIFT)

/* Bitfield definition for register of struct array PWM: DEAD_AREA */
/*
 * DEAD_AREA (RW)
 *
 * 16bit cycle delay plus 8bit hr_delay
 * min value is 2 cycles, less than 0x200 will be treated as no dead area;
 * NOTE: dead insertion must be configured with pair, that is, for pwm 01/23/45/67.
 * otherwise the result maybe UNKNOWN!!!
 */
#define PWMV2_PWM_DEAD_AREA_DEAD_AREA_MASK (0xFFFFFFUL)
#define PWMV2_PWM_DEAD_AREA_DEAD_AREA_SHIFT (0U)
#define PWMV2_PWM_DEAD_AREA_DEAD_AREA_SET(x) (((uint32_t)(x) << PWMV2_PWM_DEAD_AREA_DEAD_AREA_SHIFT) & PWMV2_PWM_DEAD_AREA_DEAD_AREA_MASK)
#define PWMV2_PWM_DEAD_AREA_DEAD_AREA_GET(x) (((uint32_t)(x) & PWMV2_PWM_DEAD_AREA_DEAD_AREA_MASK) >> PWMV2_PWM_DEAD_AREA_DEAD_AREA_SHIFT)

/* Bitfield definition for register of struct array PWM: CFG3 */
/*
 * ASYNC_FAULT_SEL (RW)
 *
 * one bit select to enable one async fault from pad, all enabled fault will be OR together with the old async fault logic.
 * (in old version, user can select one async fault by pwm_cfg0.fault_sel_async, and enabled by pwm_cfg0.fault_en_async)
 * each async fault has dedicaate polarity definition in glb_ctrl3.async_fault_pol
 */
#define PWMV2_PWM_CFG3_ASYNC_FAULT_SEL_MASK (0xFFFFU)
#define PWMV2_PWM_CFG3_ASYNC_FAULT_SEL_SHIFT (0U)
#define PWMV2_PWM_CFG3_ASYNC_FAULT_SEL_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG3_ASYNC_FAULT_SEL_SHIFT) & PWMV2_PWM_CFG3_ASYNC_FAULT_SEL_MASK)
#define PWMV2_PWM_CFG3_ASYNC_FAULT_SEL_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG3_ASYNC_FAULT_SEL_MASK) >> PWMV2_PWM_CFG3_ASYNC_FAULT_SEL_SHIFT)

/* Bitfield definition for register array: TRIGGER_CFG */
/*
 * TRIGGER_OUT_SEL (RW)
 *
 * select one from 24 compare result as trigger out, set at compare point, clear at reload point.
 * default 0x1F select nothing and output 0.
 */
#define PWMV2_TRIGGER_CFG_TRIGGER_OUT_SEL_MASK (0x1FU)
#define PWMV2_TRIGGER_CFG_TRIGGER_OUT_SEL_SHIFT (0U)
#define PWMV2_TRIGGER_CFG_TRIGGER_OUT_SEL_SET(x) (((uint32_t)(x) << PWMV2_TRIGGER_CFG_TRIGGER_OUT_SEL_SHIFT) & PWMV2_TRIGGER_CFG_TRIGGER_OUT_SEL_MASK)
#define PWMV2_TRIGGER_CFG_TRIGGER_OUT_SEL_GET(x) (((uint32_t)(x) & PWMV2_TRIGGER_CFG_TRIGGER_OUT_SEL_MASK) >> PWMV2_TRIGGER_CFG_TRIGGER_OUT_SEL_SHIFT)

/* Bitfield definition for register: GLB_CTRL */
/*
 * SW_FORCE (RW)
 *
 * software write 1 to start software force, if the pwm_cfg<n>.sw_force_en is set, force will take effort
 */
#define PWMV2_GLB_CTRL_SW_FORCE_MASK (0xFF0000UL)
#define PWMV2_GLB_CTRL_SW_FORCE_SHIFT (16U)
#define PWMV2_GLB_CTRL_SW_FORCE_SET(x) (((uint32_t)(x) << PWMV2_GLB_CTRL_SW_FORCE_SHIFT) & PWMV2_GLB_CTRL_SW_FORCE_MASK)
#define PWMV2_GLB_CTRL_SW_FORCE_GET(x) (((uint32_t)(x) & PWMV2_GLB_CTRL_SW_FORCE_MASK) >> PWMV2_GLB_CTRL_SW_FORCE_SHIFT)

/*
 * OUTPUT_DELAY (RW)
 *
 * add delay after dead_area insertiong logic, for hr_pwm
 */
#define PWMV2_GLB_CTRL_OUTPUT_DELAY_MASK (0x300U)
#define PWMV2_GLB_CTRL_OUTPUT_DELAY_SHIFT (8U)
#define PWMV2_GLB_CTRL_OUTPUT_DELAY_SET(x) (((uint32_t)(x) << PWMV2_GLB_CTRL_OUTPUT_DELAY_SHIFT) & PWMV2_GLB_CTRL_OUTPUT_DELAY_MASK)
#define PWMV2_GLB_CTRL_OUTPUT_DELAY_GET(x) (((uint32_t)(x) & PWMV2_GLB_CTRL_OUTPUT_DELAY_MASK) >> PWMV2_GLB_CTRL_OUTPUT_DELAY_SHIFT)

/*
 * HR_PWM_EN (RW)
 *
 * set to enable hr pwm, clear to bypass delay chain.
 */
#define PWMV2_GLB_CTRL_HR_PWM_EN_MASK (0x10U)
#define PWMV2_GLB_CTRL_HR_PWM_EN_SHIFT (4U)
#define PWMV2_GLB_CTRL_HR_PWM_EN_SET(x) (((uint32_t)(x) << PWMV2_GLB_CTRL_HR_PWM_EN_SHIFT) & PWMV2_GLB_CTRL_HR_PWM_EN_MASK)
#define PWMV2_GLB_CTRL_HR_PWM_EN_GET(x) (((uint32_t)(x) & PWMV2_GLB_CTRL_HR_PWM_EN_MASK) >> PWMV2_GLB_CTRL_HR_PWM_EN_SHIFT)

/*
 * FRAC_DISABLE (RW)
 *
 * set to disable bit[7:0] in DAC value when Calculation Unit use it.
 */
#define PWMV2_GLB_CTRL_FRAC_DISABLE_MASK (0x8U)
#define PWMV2_GLB_CTRL_FRAC_DISABLE_SHIFT (3U)
#define PWMV2_GLB_CTRL_FRAC_DISABLE_SET(x) (((uint32_t)(x) << PWMV2_GLB_CTRL_FRAC_DISABLE_SHIFT) & PWMV2_GLB_CTRL_FRAC_DISABLE_MASK)
#define PWMV2_GLB_CTRL_FRAC_DISABLE_GET(x) (((uint32_t)(x) & PWMV2_GLB_CTRL_FRAC_DISABLE_MASK) >> PWMV2_GLB_CTRL_FRAC_DISABLE_SHIFT)

/* Bitfield definition for register: GLB_CTRL2 */
/*
 * DAC_SW_MODE (RW)
 *
 * set for software DAC mode, software can write dac_value*_sv directly, and dac_valid from moto system is ignored
 */
#define PWMV2_GLB_CTRL2_DAC_SW_MODE_MASK (0xF000000UL)
#define PWMV2_GLB_CTRL2_DAC_SW_MODE_SHIFT (24U)
#define PWMV2_GLB_CTRL2_DAC_SW_MODE_SET(x) (((uint32_t)(x) << PWMV2_GLB_CTRL2_DAC_SW_MODE_SHIFT) & PWMV2_GLB_CTRL2_DAC_SW_MODE_MASK)
#define PWMV2_GLB_CTRL2_DAC_SW_MODE_GET(x) (((uint32_t)(x) & PWMV2_GLB_CTRL2_DAC_SW_MODE_MASK) >> PWMV2_GLB_CTRL2_DAC_SW_MODE_SHIFT)

/*
 * DEBUG_OPT (RW)
 *
 * set to disable debug fault immediately when exit debug mode
 */
#define PWMV2_GLB_CTRL2_DEBUG_OPT_MASK (0x400000UL)
#define PWMV2_GLB_CTRL2_DEBUG_OPT_SHIFT (22U)
#define PWMV2_GLB_CTRL2_DEBUG_OPT_SET(x) (((uint32_t)(x) << PWMV2_GLB_CTRL2_DEBUG_OPT_SHIFT) & PWMV2_GLB_CTRL2_DEBUG_OPT_MASK)
#define PWMV2_GLB_CTRL2_DEBUG_OPT_GET(x) (((uint32_t)(x) & PWMV2_GLB_CTRL2_DEBUG_OPT_MASK) >> PWMV2_GLB_CTRL2_DEBUG_OPT_SHIFT)

/*
 * DEBUG_IN_EN (RW)
 *
 * set to enable debug_in signal as fault signal, generally disable pwm output
 */
#define PWMV2_GLB_CTRL2_DEBUG_IN_EN_MASK (0x200000UL)
#define PWMV2_GLB_CTRL2_DEBUG_IN_EN_SHIFT (21U)
#define PWMV2_GLB_CTRL2_DEBUG_IN_EN_SET(x) (((uint32_t)(x) << PWMV2_GLB_CTRL2_DEBUG_IN_EN_SHIFT) & PWMV2_GLB_CTRL2_DEBUG_IN_EN_MASK)
#define PWMV2_GLB_CTRL2_DEBUG_IN_EN_GET(x) (((uint32_t)(x) & PWMV2_GLB_CTRL2_DEBUG_IN_EN_MASK) >> PWMV2_GLB_CTRL2_DEBUG_IN_EN_SHIFT)

