hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_pwmv2_regs.h
/*
 * FAULT_CLEAR (RW)
 *
 * software write 1 to clear fault event if pwm_cfg.fault_rec_time is 2'b11.
 * software need to clear it after the fault signal is de-assert and before next fault
 * one bit for one pwm channel
 */
#define PWMV2_GLB_CTRL2_FAULT_CLEAR_MASK (0xFF00U)
#define PWMV2_GLB_CTRL2_FAULT_CLEAR_SHIFT (8U)
#define PWMV2_GLB_CTRL2_FAULT_CLEAR_SET(x) (((uint32_t)(x) << PWMV2_GLB_CTRL2_FAULT_CLEAR_SHIFT) & PWMV2_GLB_CTRL2_FAULT_CLEAR_MASK)
#define PWMV2_GLB_CTRL2_FAULT_CLEAR_GET(x) (((uint32_t)(x) & PWMV2_GLB_CTRL2_FAULT_CLEAR_MASK) >> PWMV2_GLB_CTRL2_FAULT_CLEAR_SHIFT)

/*
 * SHADOW_LOCK_EN (RW)
 *
 * enable shadow_lock feature, if cleared, shadow_lock will be always 0
 */
#define PWMV2_GLB_CTRL2_SHADOW_LOCK_EN_MASK (0x1U)
#define PWMV2_GLB_CTRL2_SHADOW_LOCK_EN_SHIFT (0U)
#define PWMV2_GLB_CTRL2_SHADOW_LOCK_EN_SET(x) (((uint32_t)(x) << PWMV2_GLB_CTRL2_SHADOW_LOCK_EN_SHIFT) & PWMV2_GLB_CTRL2_SHADOW_LOCK_EN_MASK)
#define PWMV2_GLB_CTRL2_SHADOW_LOCK_EN_GET(x) (((uint32_t)(x) & PWMV2_GLB_CTRL2_SHADOW_LOCK_EN_MASK) >> PWMV2_GLB_CTRL2_SHADOW_LOCK_EN_SHIFT)

/* Bitfield definition for register: GLB_CTRL3 */
/*
 * ASYNC_FAULT_POL (RW)
 *
 * async fault polarity, default 0 for active high; set to 1 for active low
 */
#define PWMV2_GLB_CTRL3_ASYNC_FAULT_POL_MASK (0xFFFFU)
#define PWMV2_GLB_CTRL3_ASYNC_FAULT_POL_SHIFT (0U)
#define PWMV2_GLB_CTRL3_ASYNC_FAULT_POL_SET(x) (((uint32_t)(x) << PWMV2_GLB_CTRL3_ASYNC_FAULT_POL_SHIFT) & PWMV2_GLB_CTRL3_ASYNC_FAULT_POL_MASK)
#define PWMV2_GLB_CTRL3_ASYNC_FAULT_POL_GET(x) (((uint32_t)(x) & PWMV2_GLB_CTRL3_ASYNC_FAULT_POL_MASK) >> PWMV2_GLB_CTRL3_ASYNC_FAULT_POL_SHIFT)

/* Bitfield definition for register array: CNT_RELOAD_WORK */
/*
 * VALUE (RO)
 *
 * counter0 reload working register
 */
#define PWMV2_CNT_RELOAD_WORK_VALUE_MASK (0xFFFFFFFFUL)
#define PWMV2_CNT_RELOAD_WORK_VALUE_SHIFT (0U)
#define PWMV2_CNT_RELOAD_WORK_VALUE_GET(x) (((uint32_t)(x) & PWMV2_CNT_RELOAD_WORK_VALUE_MASK) >> PWMV2_CNT_RELOAD_WORK_VALUE_SHIFT)

/* Bitfield definition for register array: CMP_VAL_WORK */
/*
 * VALUE (RO)
 *
 * compare point working register
 */
#define PWMV2_CMP_VAL_WORK_VALUE_MASK (0xFFFFFFFFUL)
#define PWMV2_CMP_VAL_WORK_VALUE_SHIFT (0U)
#define PWMV2_CMP_VAL_WORK_VALUE_GET(x) (((uint32_t)(x) & PWMV2_CMP_VAL_WORK_VALUE_MASK) >> PWMV2_CMP_VAL_WORK_VALUE_SHIFT)

/* Bitfield definition for register: FORCE_WORK */
/*
 * OUT_POLARITY (RO)
 *
 * force working register
 */
#define PWMV2_FORCE_WORK_OUT_POLARITY_MASK (0xFF0000UL)
#define PWMV2_FORCE_WORK_OUT_POLARITY_SHIFT (16U)
#define PWMV2_FORCE_WORK_OUT_POLARITY_GET(x) (((uint32_t)(x) & PWMV2_FORCE_WORK_OUT_POLARITY_MASK) >> PWMV2_FORCE_WORK_OUT_POLARITY_SHIFT)

/*
 * FORCE_MODE (RO)
 *
 * force_mode work register
 */
#define PWMV2_FORCE_WORK_FORCE_MODE_MASK (0xFFFFU)
#define PWMV2_FORCE_WORK_FORCE_MODE_SHIFT (0U)
#define PWMV2_FORCE_WORK_FORCE_MODE_GET(x) (((uint32_t)(x) & PWMV2_FORCE_WORK_FORCE_MODE_MASK) >> PWMV2_FORCE_WORK_FORCE_MODE_SHIFT)

/* Bitfield definition for register array: CNT_VAL */
/*
 * VALUE (RO)
 *
 * main counter value
 */
#define PWMV2_CNT_VAL_VALUE_MASK (0xFFFFFFFFUL)
#define PWMV2_CNT_VAL_VALUE_SHIFT (0U)
#define PWMV2_CNT_VAL_VALUE_GET(x) (((uint32_t)(x) & PWMV2_CNT_VAL_VALUE_MASK) >> PWMV2_CNT_VAL_VALUE_SHIFT)

/* Bitfield definition for register array: DAC_VALUE_SV */
/*
 * VALUE (RW)
 *
 * save dac0_value when dac0_valid if dac_sw_mode is 0;
 * software write dac_value directly if dac_sw_mode is 1
 */
#define PWMV2_DAC_VALUE_SV_VALUE_MASK (0xFFFFFFFFUL)
#define PWMV2_DAC_VALUE_SV_VALUE_SHIFT (0U)
#define PWMV2_DAC_VALUE_SV_VALUE_SET(x) (((uint32_t)(x) << PWMV2_DAC_VALUE_SV_VALUE_SHIFT) & PWMV2_DAC_VALUE_SV_VALUE_MASK)
#define PWMV2_DAC_VALUE_SV_VALUE_GET(x) (((uint32_t)(x) & PWMV2_DAC_VALUE_SV_VALUE_MASK) >> PWMV2_DAC_VALUE_SV_VALUE_SHIFT)

/* Bitfield definition for register array: CAPTURE_POS */
/*
 * CAPTURE_POS (RO)
 *
 * related counter value captured at input negedge
 */
#define PWMV2_CAPTURE_POS_CAPTURE_POS_MASK (0xFFFFFF00UL)
#define PWMV2_CAPTURE_POS_CAPTURE_POS_SHIFT (8U)
#define PWMV2_CAPTURE_POS_CAPTURE_POS_GET(x) (((uint32_t)(x) & PWMV2_CAPTURE_POS_CAPTURE_POS_MASK) >> PWMV2_CAPTURE_POS_CAPTURE_POS_SHIFT)

/*
 * CAPTURE_SELGPIO (RW)
 *
 * 0: result from CAP[  7:0],  from trgm
 * 1: result from CAP[15:8],  from gpio
 */
#define PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_MASK (0x10U)
#define PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_SHIFT (4U)
#define PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_SET(x) (((uint32_t)(x) << PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_SHIFT) & PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_MASK)
#define PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_GET(x) (((uint32_t)(x) & PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_MASK) >> PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_SHIFT)

/*
 * CNT_INDEX (RW)
 *
 * related counter
 */
#define PWMV2_CAPTURE_POS_CNT_INDEX_MASK (0x3U)
#define PWMV2_CAPTURE_POS_CNT_INDEX_SHIFT (0U)
#define PWMV2_CAPTURE_POS_CNT_INDEX_SET(x) (((uint32_t)(x) << PWMV2_CAPTURE_POS_CNT_INDEX_SHIFT) & PWMV2_CAPTURE_POS_CNT_INDEX_MASK)
#define PWMV2_CAPTURE_POS_CNT_INDEX_GET(x) (((uint32_t)(x) & PWMV2_CAPTURE_POS_CNT_INDEX_MASK) >> PWMV2_CAPTURE_POS_CNT_INDEX_SHIFT)

/* Bitfield definition for register array: CAPTURE_NEG */
/*
 * CAPTURE_NEG (RO)
 *
 * counter value captured at input negedge
 */
#define PWMV2_CAPTURE_NEG_CAPTURE_NEG_MASK (0xFFFFFF00UL)
#define PWMV2_CAPTURE_NEG_CAPTURE_NEG_SHIFT (8U)
#define PWMV2_CAPTURE_NEG_CAPTURE_NEG_GET(x) (((uint32_t)(x) & PWMV2_CAPTURE_NEG_CAPTURE_NEG_MASK) >> PWMV2_CAPTURE_NEG_CAPTURE_NEG_SHIFT)

/* Bitfield definition for register: IRQ_STS */
/*
 * IRQ_CAL_OVERFLOW (W1C)
 *
 * end of output burst
 */
#define PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_MASK (0x80000000UL)
#define PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_SHIFT (31U)
#define PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_SET(x) (((uint32_t)(x) << PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_SHIFT) & PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_MASK)
#define PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_GET(x) (((uint32_t)(x) & PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_MASK) >> PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_SHIFT)

