hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_pwmv2_regs.h
/*
 * CNT_D_PARAM (RW)
 *
 * input dac data parameter
 */
#define PWMV2_CNT_CFG0_CNT_D_PARAM_MASK (0x1FU)
#define PWMV2_CNT_CFG0_CNT_D_PARAM_SHIFT (0U)
#define PWMV2_CNT_CFG0_CNT_D_PARAM_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG0_CNT_D_PARAM_SHIFT) & PWMV2_CNT_CFG0_CNT_D_PARAM_MASK)
#define PWMV2_CNT_CFG0_CNT_D_PARAM_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG0_CNT_D_PARAM_MASK) >> PWMV2_CNT_CFG0_CNT_D_PARAM_SHIFT)

/* Bitfield definition for register of struct array CNT: CFG1 */
/*
 * CNT_DAC_INDEX (RW)
 *
 * select one of the dac value
 */
#define PWMV2_CNT_CFG1_CNT_DAC_INDEX_MASK (0x3000000UL)
#define PWMV2_CNT_CFG1_CNT_DAC_INDEX_SHIFT (24U)
#define PWMV2_CNT_CFG1_CNT_DAC_INDEX_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG1_CNT_DAC_INDEX_SHIFT) & PWMV2_CNT_CFG1_CNT_DAC_INDEX_MASK)
#define PWMV2_CNT_CFG1_CNT_DAC_INDEX_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG1_CNT_DAC_INDEX_MASK) >> PWMV2_CNT_CFG1_CNT_DAC_INDEX_SHIFT)

/*
 * CNT_LU_EN (RW)
 *
 * set to enable up limit, use cnt_lu_off to select one of the shadow register value as limitation
 */
#define PWMV2_CNT_CFG1_CNT_LU_EN_MASK (0x800000UL)
#define PWMV2_CNT_CFG1_CNT_LU_EN_SHIFT (23U)
#define PWMV2_CNT_CFG1_CNT_LU_EN_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG1_CNT_LU_EN_SHIFT) & PWMV2_CNT_CFG1_CNT_LU_EN_MASK)
#define PWMV2_CNT_CFG1_CNT_LU_EN_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG1_CNT_LU_EN_MASK) >> PWMV2_CNT_CFG1_CNT_LU_EN_SHIFT)

/*
 * CNT_LIM_UP (RW)
 *
 * up limit offset selection, from one of the shadow_val
 */
#define PWMV2_CNT_CFG1_CNT_LIM_UP_MASK (0x1F0000UL)
#define PWMV2_CNT_CFG1_CNT_LIM_UP_SHIFT (16U)
#define PWMV2_CNT_CFG1_CNT_LIM_UP_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG1_CNT_LIM_UP_SHIFT) & PWMV2_CNT_CFG1_CNT_LIM_UP_MASK)
#define PWMV2_CNT_CFG1_CNT_LIM_UP_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG1_CNT_LIM_UP_MASK) >> PWMV2_CNT_CFG1_CNT_LIM_UP_SHIFT)

/*
 * CNT_LL_EN (RW)
 *
 * set to enable low limit
 */
#define PWMV2_CNT_CFG1_CNT_LL_EN_MASK (0x8000U)
#define PWMV2_CNT_CFG1_CNT_LL_EN_SHIFT (15U)
#define PWMV2_CNT_CFG1_CNT_LL_EN_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG1_CNT_LL_EN_SHIFT) & PWMV2_CNT_CFG1_CNT_LL_EN_MASK)
#define PWMV2_CNT_CFG1_CNT_LL_EN_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG1_CNT_LL_EN_MASK) >> PWMV2_CNT_CFG1_CNT_LL_EN_SHIFT)

/*
 * CNT_LIM_LO (RW)
 *
 * low limit offset selection, from one of the shadow_val
 */
#define PWMV2_CNT_CFG1_CNT_LIM_LO_MASK (0x1F00U)
#define PWMV2_CNT_CFG1_CNT_LIM_LO_SHIFT (8U)
#define PWMV2_CNT_CFG1_CNT_LIM_LO_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG1_CNT_LIM_LO_SHIFT) & PWMV2_CNT_CFG1_CNT_LIM_LO_MASK)
#define PWMV2_CNT_CFG1_CNT_LIM_LO_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG1_CNT_LIM_LO_MASK) >> PWMV2_CNT_CFG1_CNT_LIM_LO_SHIFT)

/*
 * CNT_IN_OFF (RW)
 *
 * input data offset selection, from one of the shadow_val, default just shadow reload time
 */
#define PWMV2_CNT_CFG1_CNT_IN_OFF_MASK (0x1FU)
#define PWMV2_CNT_CFG1_CNT_IN_OFF_SHIFT (0U)
#define PWMV2_CNT_CFG1_CNT_IN_OFF_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG1_CNT_IN_OFF_SHIFT) & PWMV2_CNT_CFG1_CNT_IN_OFF_MASK)
#define PWMV2_CNT_CFG1_CNT_IN_OFF_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG1_CNT_IN_OFF_MASK) >> PWMV2_CNT_CFG1_CNT_IN_OFF_SHIFT)

/* Bitfield definition for register of struct array CNT: CFG2 */
/*
 * CNT_RELOAD_EN (RW)
 *
 * set to use input signal(selected by cnt_reload_trig) to reload timer
 */
#define PWMV2_CNT_CFG2_CNT_RELOAD_EN_MASK (0x80000000UL)
#define PWMV2_CNT_CFG2_CNT_RELOAD_EN_SHIFT (31U)
#define PWMV2_CNT_CFG2_CNT_RELOAD_EN_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG2_CNT_RELOAD_EN_SHIFT) & PWMV2_CNT_CFG2_CNT_RELOAD_EN_MASK)
#define PWMV2_CNT_CFG2_CNT_RELOAD_EN_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG2_CNT_RELOAD_EN_MASK) >> PWMV2_CNT_CFG2_CNT_RELOAD_EN_SHIFT)

/*
 * CNT_RELOAD_TRIG (RW)
 *
 * select one trigger from 8, should set to pulse in trig_mux
 */
#define PWMV2_CNT_CFG2_CNT_RELOAD_TRIG_MASK (0x7000000UL)
#define PWMV2_CNT_CFG2_CNT_RELOAD_TRIG_SHIFT (24U)
#define PWMV2_CNT_CFG2_CNT_RELOAD_TRIG_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG2_CNT_RELOAD_TRIG_SHIFT) & PWMV2_CNT_CFG2_CNT_RELOAD_TRIG_MASK)
#define PWMV2_CNT_CFG2_CNT_RELOAD_TRIG_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG2_CNT_RELOAD_TRIG_MASK) >> PWMV2_CNT_CFG2_CNT_RELOAD_TRIG_SHIFT)

/*
 * CNT_UPDATE_TRIG1 (RW)
 *
 * select one trigger from 8, should set to pulse in trig_mux
 */
#define PWMV2_CNT_CFG2_CNT_UPDATE_TRIG1_MASK (0x700000UL)
#define PWMV2_CNT_CFG2_CNT_UPDATE_TRIG1_SHIFT (20U)
#define PWMV2_CNT_CFG2_CNT_UPDATE_TRIG1_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG2_CNT_UPDATE_TRIG1_SHIFT) & PWMV2_CNT_CFG2_CNT_UPDATE_TRIG1_MASK)
#define PWMV2_CNT_CFG2_CNT_UPDATE_TRIG1_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG2_CNT_UPDATE_TRIG1_MASK) >> PWMV2_CNT_CFG2_CNT_UPDATE_TRIG1_SHIFT)

/*
 * CNT_UPDATE_EN1 (RW)
 *
 * set to enable using trig1 to load calculation cell output to counter
 */
#define PWMV2_CNT_CFG2_CNT_UPDATE_EN1_MASK (0x80000UL)
#define PWMV2_CNT_CFG2_CNT_UPDATE_EN1_SHIFT (19U)
#define PWMV2_CNT_CFG2_CNT_UPDATE_EN1_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG2_CNT_UPDATE_EN1_SHIFT) & PWMV2_CNT_CFG2_CNT_UPDATE_EN1_MASK)
#define PWMV2_CNT_CFG2_CNT_UPDATE_EN1_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG2_CNT_UPDATE_EN1_MASK) >> PWMV2_CNT_CFG2_CNT_UPDATE_EN1_SHIFT)

/*
 * CNT_TRIG1 (RW)
 *
 * change counter value to one of the calculation cell output when cnt_update_triger1 issued
 */
#define PWMV2_CNT_CFG2_CNT_TRIG1_MASK (0xF000U)
#define PWMV2_CNT_CFG2_CNT_TRIG1_SHIFT (12U)
#define PWMV2_CNT_CFG2_CNT_TRIG1_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG2_CNT_TRIG1_SHIFT) & PWMV2_CNT_CFG2_CNT_TRIG1_MASK)
#define PWMV2_CNT_CFG2_CNT_TRIG1_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG2_CNT_TRIG1_MASK) >> PWMV2_CNT_CFG2_CNT_TRIG1_SHIFT)

/*
 * CNT_UPDATE_TRIG0 (RW)
 *
 * select one trigger from 8, should set to pulse in trig_mux
 */
#define PWMV2_CNT_CFG2_CNT_UPDATE_TRIG0_MASK (0x700U)
#define PWMV2_CNT_CFG2_CNT_UPDATE_TRIG0_SHIFT (8U)
#define PWMV2_CNT_CFG2_CNT_UPDATE_TRIG0_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG2_CNT_UPDATE_TRIG0_SHIFT) & PWMV2_CNT_CFG2_CNT_UPDATE_TRIG0_MASK)
#define PWMV2_CNT_CFG2_CNT_UPDATE_TRIG0_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG2_CNT_UPDATE_TRIG0_MASK) >> PWMV2_CNT_CFG2_CNT_UPDATE_TRIG0_SHIFT)

